#                                        Pandas - Series & DataFrames

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
import math
import glob   # use to reterive files or patterns

# Series

## Create Series

In [2]:
v= np.array([1,2,3,4,5,6,7,8])
s1=pd.Series(v)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int32

In [3]:
s1.dtypes

dtype('int32')

In [4]:
s1.itemsize

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

4

In [5]:
s1.shape

(8,)

In [6]:
s1.count()

8

In [7]:
#creating Series with index
s0=pd.Series([1,2,3,5],index=['a','b','c','e'])
s0

a    1
b    2
c    3
e    5
dtype: int64

In [8]:
# modifying the existing series 
s1.index=['a','b','c','e','f','g','h','i']
s1

a    1
b    2
c    3
e    4
f    5
g    6
h    7
i    8
dtype: int32

In [9]:
# Creating series using Random and range functions
v2= np.random.random(10)
ind1= np.arange(0,10)
s=pd.Series(v2,ind1)
v2,ind1,s

(array([0.52633907, 0.38451363, 0.55861095, 0.75194517, 0.3440874 ,
        0.90235964, 0.05654897, 0.3321936 , 0.3083078 , 0.79793207]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.526339
 1    0.384514
 2    0.558611
 3    0.751945
 4    0.344087
 5    0.902360
 6    0.056549
 7    0.332194
 8    0.308308
 9    0.797932
 dtype: float64)

In [10]:
#creating series from Dictionary
dict1= {'a':1,'b':2,'c':3,'d':4}
s3=pd.Series(dict1)
s3

a    1
b    2
c    3
d    4
dtype: int64

## Slicing Series

In [11]:
s

0    0.526339
1    0.384514
2    0.558611
3    0.751945
4    0.344087
5    0.902360
6    0.056549
7    0.332194
8    0.308308
9    0.797932
dtype: float64

In [12]:
s[:2] #first 2 rows

0    0.526339
1    0.384514
dtype: float64

In [13]:
s[::1]  #inversion

0    0.526339
1    0.384514
2    0.558611
3    0.751945
4    0.344087
5    0.902360
6    0.056549
7    0.332194
8    0.308308
9    0.797932
dtype: float64

In [14]:
# slicing s[satrt of elements: end of elements : step size]
s[2:6:2]

2    0.558611
4    0.344087
dtype: float64

## Append Series

In [15]:
print(dir(s)) #to check the libraries for series data type

['T', '_AXIS_ALIASES', '_AXIS_IALIASES', '_AXIS_LEN', '_AXIS_NAMES', '_AXIS_NUMBERS', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_SLICEMAP', '__abs__', '__add__', '__and__', '__array__', '__array_prepare__', '__array_priority__', '__array_wrap__', '__bool__', '__bytes__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__div__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__long__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdiv__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__unicode__', '__weakref__', '__xor__', '_accessors', '_add_numeric_operations', '_add_series_only_operations', '_add_series_or_dataframe_operations', '_agg_by_level', '_agg_examples_doc', '_agg_see_also_doc', '_aggregate', '_aggregate_multiple_funcs', '_align_frame', '_align_series', '_binop', '_box_item_values', '_builtin_table', '_can_hold_na', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_percentile', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_dict_for_slice', '_construct_axes_dict_from', '_construct_axes_from_arguments', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_create_indexer', '_cython_table', '_deprecations', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_expand_axes', '_find_valid_index', '_formatting_values', '_from_axes', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_get_values', '_get_values_tuple', '_get_with', '_gotitem', '_iget_item_cache', '_index', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_copy', '_is_cython_func', '_is_datelike_mixed_type', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_numeric_mixed_type', '_is_view', '_ix', '_ixs', '_map_values', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_ndarray_values', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_is_copy', '_set_item', '_set_labels', '_set_name', '_set_subtyp', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_setup_axes', '_shallow_copy', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_take', '_to_dict_of_blocks', '_try_aggregate_string_function', '_typ', '_unpickle_series_compat', '_update_inplace', '_validate_dtype', '_values', '_where', '_xs', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'as_matrix', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'autocorr', 'axes', 'base', 'between', 'between_time', 'bfill', 'bool', 'clip', 'clip_lower', 'clip_upper', 'combine', 'combine_first', 'compound', 'compress', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'data', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_array', 'ftype', 'ftypes', 'ge', 'get', 'get_dtype_counts', 'get_ftype_counts', 'get_values', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'imag', 'index', 'infer_objects', 'interpolate', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'itemsize', 'iteritems', 'ix', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'nonzero', 'notna', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'ptp', 'put', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'real', 'reindex', 'reindex_axis', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'select', 'sem', 'set_axis', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'std', 'strides', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'timetuple', 'to_clipboard', 'to_csv', 'to_dense', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_msgpack', 'to_numpy', 'to_period', 'to_pickle', 'to_sparse', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [16]:
s3= s.copy()
s

0    0.526339
1    0.384514
2    0.558611
3    0.751945
4    0.344087
5    0.902360
6    0.056549
7    0.332194
8    0.308308
9    0.797932
dtype: float64

In [17]:
s.drop(2,inplace=False)

0    0.526339
1    0.384514
3    0.751945
4    0.344087
5    0.902360
6    0.056549
7    0.332194
8    0.308308
9    0.797932
dtype: float64

In [18]:
s=s.append(pd.Series(0.5343))
s

0    0.526339
1    0.384514
2    0.558611
3    0.751945
4    0.344087
5    0.902360
6    0.056549
7    0.332194
8    0.308308
9    0.797932
0    0.534300
dtype: float64

In [19]:
#Addition ,multiplication,subtraction

In [20]:
s1.add(12)

a    13
b    14
c    15
e    16
f    17
g    18
h    19
i    20
dtype: int32

In [21]:
s1.mul(5)

a     5
b    10
c    15
e    20
f    25
g    30
h    35
i    40
dtype: int32

In [22]:
s1.subtract(2)

a   -1
b    0
c    1
e    2
f    3
g    4
h    5
i    6
dtype: int32

In [23]:
s1.max() #maximum

8

In [24]:
s1.min() #minimum

1

In [25]:
s1.mean() # Average or mean

4.5

In [26]:
s1.median()  # median

4.5

In [27]:
s1.mode()[0] #mode

1

In [28]:
s1.std()  #standard deviation

2.449489742783178

In [29]:
s1.equals(s3)   #series comparison

False

# DataFrames

In [30]:
#creat DataFrame
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [31]:
#Create Dataframe from Dictionary
data=[{'a':1,'b':2},{'a':5,'b':6,'c':8}]
df1= pd.DataFrame(data)
df2=pd.DataFrame(data,index=['row1','row2'],columns=['a','b'])
df3=pd.DataFrame(data,index=['row1','row2'],columns=['a','b','c'])

In [32]:
df2

      a  b
row1  1  2
row2  5  6

In [33]:
df3

      a  b    c
row1  1  2  NaN
row2  5  6  8.0

In [34]:
df0=pd.DataFrame({'ID':[1,2,3,4],'Name':['Prince','Atul','Deepak','Satish']})
df0

   ID    Name
0   1  Prince
1   2    Atul
2   3  Deepak
3   4  Satish

### Dataframe of random numbers with date Indices

In [35]:
dates=pd.date_range(start='2020-05-05',end='2020-05-10')
dates

DatetimeIndex(['2020-05-05', '2020-05-06', '2020-05-07', '2020-05-08',
               '2020-05-09', '2020-05-10'],
              dtype='datetime64[ns]', freq='D')

In [36]:
dates1= pd.date_range(start='2020-05-05',periods=5)
dates1

DatetimeIndex(['2020-05-05', '2020-05-06', '2020-05-07', '2020-05-08',
               '2020-05-09'],
              dtype='datetime64[ns]', freq='D')

In [37]:
M= np.random.random((5,5))
M

array([[0.68971347, 0.86370213, 0.39583718, 0.49071286, 0.73125997],
       [0.46409018, 0.33432478, 0.39318081, 0.61186785, 0.13873265],
       [0.86611168, 0.33536953, 0.36191788, 0.0904383 , 0.77026275],
       [0.12615749, 0.72199362, 0.09445629, 0.57205103, 0.30661915],
       [0.30719687, 0.87669719, 0.96607834, 0.11727138, 0.11705512]])

In [38]:
dframe=pd.DataFrame(M,index=dates1)
dframe

                   0         1         2         3         4
2020-05-05  0.689713  0.863702  0.395837  0.490713  0.731260
2020-05-06  0.464090  0.334325  0.393181  0.611868  0.138733
2020-05-07  0.866112  0.335370  0.361918  0.090438  0.770263
2020-05-08  0.126157  0.721994  0.094456  0.572051  0.306619
2020-05-09  0.307197  0.876697  0.966078  0.117271  0.117055

In [39]:
dframe.columns=['c1','c2','c3','c4','c5']
dframe

                  c1        c2        c3        c4        c5
2020-05-05  0.689713  0.863702  0.395837  0.490713  0.731260
2020-05-06  0.464090  0.334325  0.393181  0.611868  0.138733
2020-05-07  0.866112  0.335370  0.361918  0.090438  0.770263
2020-05-08  0.126157  0.721994  0.094456  0.572051  0.306619
2020-05-09  0.307197  0.876697  0.966078  0.117271  0.117055

In [40]:
#sorting Dataframe by column'c1' in ascending order
dframe.sort_values(by='c1')
dframe

                  c1        c2        c3        c4        c5
2020-05-05  0.689713  0.863702  0.395837  0.490713  0.731260
2020-05-06  0.464090  0.334325  0.393181  0.611868  0.138733
2020-05-07  0.866112  0.335370  0.361918  0.090438  0.770263
2020-05-08  0.126157  0.721994  0.094456  0.572051  0.306619
2020-05-09  0.307197  0.876697  0.966078  0.117271  0.117055

In [41]:
#delete column from the dataframe
del dframe['c5']
dframe

                  c1        c2        c3        c4
2020-05-05  0.689713  0.863702  0.395837  0.490713
2020-05-06  0.464090  0.334325  0.393181  0.611868
2020-05-07  0.866112  0.335370  0.361918  0.090438
2020-05-08  0.126157  0.721994  0.094456  0.572051
2020-05-09  0.307197  0.876697  0.966078  0.117271

In [42]:
#Data selection using row label
df0.loc[1:2]

   ID    Name
1   2    Atul
2   3  Deepak

In [43]:
#Data selection using column label
df0.iloc[1:2]

   ID  Name
1   2  Atul

In [44]:
df0

   ID    Name
0   1  Prince
1   2    Atul
2   3  Deepak
3   4  Satish

In [45]:
df5=pd.DataFrame({'ID':[5,7,8,9],'Name':['Prince','Atul','Deepak','Satish']})
df5.index=['d1','d2','d3','d4']
df5

    ID    Name
d1   5  Prince
d2   7    Atul
d3   8  Deepak
d4   9  Satish

In [46]:
df5.loc['d1']   # data fetch by row name

ID           5
Name    Prince
Name: d1, dtype: object

In [47]:
df5.iloc[2] # data fetch by index no.

ID           8
Name    Deepak
Name: d3, dtype: object

In [48]:
df5.iloc[0:3]

    ID    Name
d1   5  Prince
d2   7    Atul
d3   8  Deepak

In [49]:
df5.loc['d1':'d3']

    ID    Name
d1   5  Prince
d2   7    Atul
d3   8  Deepak

In [50]:
df5.loc[df5.ID>5]

    ID    Name
d2   7    Atul
d3   8  Deepak
d4   9  Satish

# Analysis of Dataset using Pandas

In [51]:
# Solve the questions from Investment dataset using Pandas

## 1. read

In [52]:
df01=pd.read_csv('C:/Users/Prince Rai/Desktop/investments.csv',encoding='latin-1') #read file

In [53]:
df01.head()    #top 5 rows

,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city,funding_rounds,founded_year,debt_financing,grant
0,#waywire,http://www.waywire.com,|Entertainment|Politics|Social Media|News|,News,"17,50,000",acquired,USA,NY,New York City,New York,1,2012.0,0,0
1,&TV Communications,http://enjoyandtv.com,|Games|,Games,"40,00,000",operating,USA,CA,Los Angeles,Los Angeles,2,NaN,0,0
2,'Rock' Your Paper,http://www.rockyourpaper.org,|Publishing|Education|,Publishing,"40,000",operating,EST,NaN,Tallinn,Tallinn,1,2012.0,0,0
3,(In)Touch Network,http://www.InTouchNetwork.com,|Electronics|Guides|Coffee|Restaurants|Music|i...,Electronics,"15,00,000",operating,GBR,NaN,London,London,1,2011.0,0,0
4,-R- Ranch and Mine,NaN,|Tourism|Entertainment|Games|,Tourism,"60,000",operating,USA,TX,Dallas,Fort Worth,2,2014.0,0,0

In [54]:
df01.tail() #bottom 5 rows

,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city,funding_rounds,founded_year,debt_financing,grant
49433,Zzish,http://www.zzish.com,|Analytics|Gamification|Developer APIs|iOS|And...,Education,"3,20,000",operating,GBR,NaN,London,London,1,2013.0,0,0
49434,ZZNode Science and Technology,http://www.zznode.com,|Enterprise Software|,Enterprise Software,"15,87,301",operating,CHN,NaN,Beijing,Beijing,1,NaN,0,0
49435,Zzzzapp Wireless ltd.,http://www.zzzzapp.com,|Web Development|Advertising|Wireless|Mobile|,Web Development,"97,398",operating,HRV,NaN,Split,Split,5,2012.0,0,0
49436,[a]list games,http://www.alistgames.com,|Games|,Games,"93,00,000",operating,NaN,NaN,NaN,NaN,1,NaN,0,0
49437,[x+1],http://www.xplusone.com/,|Enterprise Software|,Enterprise Software,"4,50,00,000",operating,USA,NY,New York City,New York,4,1999.0,17000000,0

## 2. List out all the coulmn names

In [55]:
col= df01.columns
col

Index(['name', 'homepage_url', 'category_list', ' market ',
       ' funding_total_usd ', 'status', 'country_code', 'state_code', 'region',
       'city', 'funding_rounds', 'founded_year', 'debt_financing', 'grant'],
      dtype='object')

## 3. create a dataframe with numerical columns

In [56]:
df_numerical= df01.select_dtypes(include=np.number).columns  #numerical data column
df_numerical

Index(['funding_rounds', 'founded_year', 'debt_financing', 'grant'], dtype='object')

## 4.create a dataframe with categorical columns

In [57]:
df_categorical=df01.select_dtypes(include=np.object).columns   #categorical data column
df_categorical

Index(['name', 'homepage_url', 'category_list', ' market ',
       ' funding_total_usd ', 'status', 'country_code', 'state_code', 'region',
       'city'],
      dtype='object')

## 5.Get summary of the data and draw interference if any

In [58]:
df01.describe()                                   # to get the summary of the data

       funding_rounds  founded_year  debt_financing         grant
count    49438.000000  38482.000000    4.943800e+04  4.943800e+04
mean         1.696205   2007.359129    1.888157e+06  1.628453e+05
std          1.294213      7.579203    1.382046e+08  5.612088e+06
min          1.000000   1902.000000    0.000000e+00  0.000000e+00
25%          1.000000   2006.000000    0.000000e+00  0.000000e+00
50%          1.000000   2010.000000    0.000000e+00  0.000000e+00
75%          2.000000   2012.000000    0.000000e+00  0.000000e+00
max         18.000000   2014.000000    3.007950e+10  7.505000e+08

In [59]:
df01.info()                                             # to get the information of data concise

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49438 entries, 0 to 49437
Data columns (total 14 columns):
name                   49437 non-null object
homepage_url           45989 non-null object
category_list          45477 non-null object
 market                45470 non-null object
 funding_total_usd     49438 non-null object
status                 48124 non-null object
country_code           44165 non-null object
state_code             30161 non-null object
region                 44165 non-null object
city                   43322 non-null object
funding_rounds         49438 non-null int64
founded_year           38482 non-null float64
debt_financing         49438 non-null int64
grant                  49438 non-null int64
dtypes: float64(1), int64(3), object(10)
memory usage: 5.3+ MB

## 6.Display the duplicate rows

In [60]:
df01.duplicated('name').sum()         # no.of duplicate rows displayed for name column

87

In [61]:
df01.shape

(49438, 14)

In [62]:
df01.duplicated('city').sum()           #duplicates for city column

45249

In [63]:
df01.city.unique()                      #to get the uniques values

array(['New York', 'Los Angeles', 'Tallinn', ..., 'Zwolle', 'Ahmadabad',
       'Damansara New Village'], dtype=object)

## 7.for each column find out percentage of missing values

In [74]:
round(df01.isna().sum()/df01.shape[0]*100,2)

name                    0.00
homepage_url            6.98
category_list           8.01
 market                 8.03
 funding_total_usd      0.00
status                  2.66
country_code           10.67
state_code             38.99
region                 10.67
city                   12.37
funding_rounds          0.00
founded_year           22.16
debt_financing          0.00
grant                   0.00
dtype: float64

## 8.Find count of 'name' in each 'country_code'

In [102]:
d23=df01.name.unique()
len(d23)

49351

In [100]:
d2=df01.country_code.unique()
len(d2)

116

In [97]:
a=[1,2,4,4]
len(a)

4

In [109]:
df01.head(2)

,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city,funding_rounds,founded_year,debt_financing,grant
0,#waywire,http://www.waywire.com,|Entertainment|Politics|Social Media|News|,News,"17,50,000",acquired,USA,NY,New York City,New York,1,2012.0,0,0
1,&TV Communications,http://enjoyandtv.com,|Games|,Games,"40,00,000",operating,USA,CA,Los Angeles,Los Angeles,2,NaN,0,0